# Структура квиза
quiz_data = [
    {
        'question': 'Что такое Python?',
        'options': ['Язык программирования', 'Тип данных', 'Музыкальный инструмент', 'Змея на английском'],
        'correct_option': 0
    },
    {
        'question': 'Какой тип данных используется для хранения целых чисел?',
        'options': ['int', 'float', 'str', 'natural'],
        'correct_option': 0
    },
    {
        'question': 'Сколько на данный момент существует языков программирования?',
        'options': ['Фортран', 'Ада', 'Планкалкюль'],
        'correct_option': 0
    },
    {
        'question': 'Как называется первый в мире высокоуровневый язык программирования?',
        'options': ['Около 500', 'Чуть более 1000', 'Более 8000'],
        'correct_option': 0
    },
    {
        'question': 'С какого языка началась традиция использования фразы «Hello, world!» в самой первой программе при изучении нового языка программирования?',
        'options': ['C', 'C#', 'C++', 'Java'],
        'correct_option': 0
    },
]